#!/usr/bin/env python
#coding: utf-8

_guafu_all = ['乾', '坤', '屯', '蒙', '需', '讼', '师', '比', '小畜', '履', '泰',
    '否', '同人', '大有', '谦', '豫', '随', '蛊', '临', '观', '噬嗑', '贲', '剥',
    '复', '无妄', '大畜', '颐', '大过', '坎', '离', '咸', '恒', '遁', '大壮',
    '晋', '明夷', '家人', '睽', '蹇', '解', '损', '益', '夬', '姤', '萃', '升',
    '困', '井', '革', '鼎', '震', '艮', '渐', '归妹', '丰', '旅', '巽', '兑',
    '涣', '节', '中孚', '小过', '既济', '未济']

def bagua():
    '生成八卦符号，乾坤震巽离坎艮兑；默认返回十进制的html代码，选择u模式返回unicode编码'
    pass

def guafu():
    '生成六十四组重卦符号，返回十进制(对应unicode的16进制编码)的html代码'
    s = ''
    for i in range(19904, 19968):
        s += _guafu_all[i-19904] + '&#' + str(i)
    return s


if __name__ == '__main__':
    print(guafu())
